<!-- dflook/terraform-github-actions {"workspace":"partial-workspace-echo","backend_type":"remote","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"8a97acf22c6827a84b5e02f077e2271c75b0e1059660c8c6cea56b9435e5360e","plan_job_ref":"Job Test plan target and replace #350 at https://github.com/dflook/terraform-github-actions/actions/runs/5553175125","plan_hash":"dbb1c7eab72a9b48f4a0fe286722ddaaaac3c98fba23fe7d8e2a13d11e424bad","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __partial-workspace-echo__ workspace
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "fvoS4GCbEW" -> (known after apply)
  ~ foreach = "nCBfltggXz" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #350](https://github.com/dflook/terraform-github-actions/actions/runs/5553175125)